import type { Product } from './other/types';

export const products: Product[] = [
  {
    id: 2,
    name: 'Пылесос MI VC G9',
    price: 1_500_000,
    image: require('./img/mi-vacuum.jpg'),
    description:
      'Мощный беспроводной пылесос со сменным аккумулятором и тремя ' +
      'насадками. Мощность двигателя - 400Вт, всасывания - 120аВт. ' +
      'Отлично справляется с уборкой ковров. Время работы: 60/27/8 мин, ' +
      'чего хватает на уборку 3х комнатной квартиры с коврами.',
  },
  {
    id: 3,
    name: 'Кресло черное',
    price: 800_000,
    image: require('./img/black-chair.jpg'),
    description:
      'Офисное кресло с высокой спинкой и рельефной обивкой из черной ' +
      'экокожи. Хромированные подлокотники и пятилучевая база с колесиками ' +
      'обеспечивают максимальный комфорт и мобильность. Регулируемая высота, ' +
      'стильный дизайн и превосходная эргономика для продуктивной работы.',
  },
  {
    id: 4,
    name: 'Кресло IKEA JÄRVFJÄLLET',
    image: require('./img/ikea-jarvfjallet.jpg'),
    price: 2_400_000,
    description:
      'Регулируемые подголовник, спинка, подлокотники и сиденье, сетчатая ' +
      'спинка для вентиляции, поддержка поясницы, стильный дизайн, идеально ' +
      'для долгой работы, металлический каркас и креставина. Молочный цвет. ' +
      'Брал его за более 6.5 млн., потому-что на заказ из Турции.',
  },
  {
    id: 5,
    name: 'Стол рабочий',
    price: 900_000,
    image: require('./img/table.jpg'),
    description:
      'Компьютерный стол из светлого дерева с просторной рабочей ' +
      'поверхностью 130х70 см и удобной высотой 76 см. Функциональная тумба ' +
      'с выдвижным ящиком. Качественная фурнитура, идеальное решение ' +
      'для домашнего офиса.',
  },
  {
    id: 6,
    name: 'Роутер Mikrotik hAP ac lite',
    image: require('./img/mikrotik-hap-lite-ac.png'),
    price: 580_000,
    description:
      'Компактный двухдиапазонный роутер 2,4 и 5 ГГц, скорость Wi-Fi до 433 ' +
      'Мбит/с, 5 Fast Ethernet портов, PoE in/out, USB, 64 МБ ОЗУ. Для ' +
      'использования желателен опыт работы с RouterOS.',
  },
  {
    id: 7,
    name: 'Синтезатор YAMAHA YPT 370',
    image: require('./img/yamaha-ypt-370.jpg'),
    price: 2_200_000,
    description:
      '61 динамическая клавиша, 622 выразительных тембра, автоаккомпанемент, ' +
      'обучающие функции, мощные эффекты и легкое подключение - идеальный ' +
      'выбор для вдохновения, обучения и творческих музыкальных ' +
      'экспериментов. Бонусом: стойка, кабеля, переходники.',
  },
  {
    id: 9,
    name: 'RC-модель Max Angry Beast',
    image: require('./img/rc-model.jpg'),
    price: 500_000,
    description:
      'Радиоуправляемая модель начального уровня в масштабе 1:18, ' +
      '28.1х23.5х17см, 4WD, регулировка радиуса поворота, регулировка ' +
      'скорости, дальность 30 метров, скорость до 35 км/ч. Автомобиль имеет ' +
      'крупные колеса с развитым протектором для великолепной проходимости ' +
      'самых сложных трасс и неглубоких ям с водой, без вреда техническим ' +
      'характеристикам, независимую подвеску с длинным ходом амортизаторов.',
  },
  {
    id: 10,
    name: 'Саундбар Samsung HW-Q600A',
    price: 2_900_000,
    image: require('./img/samsung-hwq600a.jpg'),
    description:
      'Мощный саундбар с системой 3.1.2, оснащённый ' +
      'беспроводным сабвуфером и поддержкой технологий Dolby Atmos и DTS:X ' +
      'для создания объёмного звука нового уровня. Устройство ' +
      'поддерживает подключение по Bluetooth, HDMI ARC и оптическому ' +
      'кабелю, а также воспроизведение музыки через USB. Эта модель ' +
      'особенно популярна на форуме 4PDA и часто рекомендуется ' +
      'пользователями как оптимальный выбор в своём ценовом ' +
      'сегменте благодаря сбалансированному звучанию.',
  },
  {
    id: 11,
    name: 'Весы Mi BC Scale 2',
    price: 200_000,
    image: require('./img/mi-body-scale.png'),
    description:
      'Измеряет 13 показателей тела, включая вес, процент жира, воды, ' +
      'мышечную и костную массу. Точность 50 г, выдерживает до 150 кг, ' +
      'синхронизация со смартфоном, стильный дизайн, память на ' +
      '16 пользователей.',
  },
  {
    id: 12,
    name: 'Кофеварка Delonghi EC785.BG',
    price: 1_700_000,
    image: require('./img/delonghi-ec785.bg.jpg'),
    description:
      'В комплекте темпер, питчер + дополнительный открытый холдер, большой ' +
      'запас кофе. Использовался только с водой из осмоса, поэтому накипи нет.',
  },
  {
    id: 13,
    name: 'Чайник Polaris PWK 1873CGLD',
    price: 150_000,
    image: require('./img/kettle.jpg'),
    description:
      'Чайник с терморегулятором 60-100°C и функцией поддержания тепла. ' +
      'Мощность 2200Вт, объем 1,8 л. Идеален для чая, кофе и детского питания.',
  },
  {
    id: 15,
    name: 'Минисистема Technics SC-EH590',
    price: 1_400_000,
    image: require('./img/technics-sc-eh590.jpg'),
    description:
      'Минисистема SC-EH590 - это народный Hi-Fi из легендарной серии ' +
      'Technics начала нулевых. Отлично подходит для использования в ' +
      'качестве компьютерной акустики, радуя чистым и мощным звуком ' +
      '(2x90Вт DIN) с bi-wiring подключением АС. В комплекте есть ' +
      'CD-проигрыватель и кассетная дека, но они отключены и на фото не ' +
      'показаны.',
  },
  {
    id: 19,
    name: 'Набор инструментов',
    price: 600_000,
    image: require('./img/tools.jpg'),
    description:
      'Большой набор инструментов для дома - включает мультиметр DT-9205A, ' +
      'паяльник с припоем и флюсами, плоскогубцы, наборы отверток, ножовка, ' +
      'изоленты, крепежные элементы, ножи, клеи, смазки и многое другое.',
  },
  {
    id: 20,
    name: 'Фен',
    price: 200_000,
    image: require('./img/hair-dryer.png'),
    description:
      'Фен с двигателем и инновационной технологией быстрой сушки. В ' +
      'комплекте 5 магнитных насадок для различных типов укладки',
  },
  {
    id: 24,
    name: 'Бассейн + насос',
    price: 250_000,
    image: require('./img/pool.jpg'),
    description:
      'Бассейн надувной детский Intex Wet Set 163x107x46 см, 230 л, со ' +
      'сливным клапаном + электрический насос и ремонтный комплект.',
  },
  {
    id: 25,
    name: 'Лампочки IKEA TOSTHULT',
    price: 70_000,
    image: require('./img/ikea-tosthult.jpg'),
    description:
      'Работают от аккумулятора при отключении электричества. Цоколь E27, ' +
      'световой поток 400 лм, теплый белый свет 2700К. Осталось 5 штук. ' +
      'IKEA 704.004.29.',
  },
  {
    id: 27,
    name: 'Ингалятор ЮЛАЙЗЕР (небулайзер)',
    price: 250_000,
    image: require('./img/nebulizer.jpg'),
    description:
      'Ингалятор Ulaizer Home для детей и взрослых. Простой в использовании. ' +
      'Подходит для всех возрастов. Пользовались мало, в комплекте НОВЫЕ ' +
      '5 сменных фильтров.',
  },
  {
    id: 28,
    name: 'Увлажнитель Mi Smart Humidifier 2',
    price: 500_000,
    image: require('./img/mi-humidifier2.jpg'),
    description:
      'Xiaomi Smart Sterilization Humidifier 2 MJJSQ05DY - Ультразвуковой ' +
      'увлажнитель с УФ-стерилизацией, объемом 4,5 л, ' +
      'производительностью до 350 мл/ч, интеллектуальным управлением через ' +
      'приложение, тихой работой и удобной верхней заливкой воды - ' +
      'для чистого и свежего воздуха.',
  },
  {
    id: 30,
    name: 'TV-приставка Game Stick Lite',
    price: 160_000,
    image: require('./img/game-stick.jpg'),
    description:
      'Миниатюрная приставка с поддержкой 4K, более 10 000 ретро-игр, двумя ' +
      'беспроводными геймпадами, HDMI-подключением, памятью 64 ГБ и ' +
      'совместимостью с PlayStation, Sega, Dendy, Atari и другими ' +
      'платформами',
  },
  {
    id: 31,
    name: 'Роутер Mikrotik hAP ax³',
    price: 1_500_000,
    image: require('./img/mikrotik-hap-ax3.png'),
    description:
      'Мощный четырехъядерный процессор 1,8 ГГц, Wi-Fi 6 ' +
      '(574+1200 Мбит/с), 2,5 Гбит/с Ethernet, 4 гигабитных порта, USB 3.0, ' +
      '1 ГБ ОЗУ, внешние антенны 5,5 dBi, поддержка PoE. Для использования ' +
      'желателен опыт работы с RouterOS.',
  },
  {
    id: 35,
    name: 'Монитор Xiaomi 4K 27"',
    price: 2_500_000,
    image: require('./img/redmi-rmmnt27nu.jpeg'),
    description:
      'Xiaomi RedmiRMMNT27NU - 27" IPS-дисплей 4K UHD (3840×2160) c ' +
      'регулировкой высоты и поворотом на 90°, HDR400, sRGB 100% и DCI-P3 ' +
      '95%, частота 60 Гц, HDMI, DisplayPort, Type-C с Power delivery может ' +
      'запитать ноутбук до 65вт.',
  },
  {
    id: 36,
    name: 'Монитор Samsung 4K 27"',
    price: 2_900_000,
    image: require('./img/samsung-ls27a800u.jpg'),
    description:
      'Samsung LS27A800U - 27" IPS монитор с 4K UHD (3840×2160) c ' +
      'регулировкой высоты и поворотом на 90°, HDR10, sRGB 99% и DCI-P3 94%, ' +
      'частота 60 Гц, HDMI, DisplayPort, Type-C с Power delivery может ' +
      'запитать ноутбук до 90вт, встроенными динамиками, эргономичной ' +
      'подставкой и безрамочным дизайном для профессионалов и ' +
      'максимального комфорта.',
  },
  {
    id: 38,
    name: 'Настольная лампа IKEA LAMPAN',
    price: 100_000,
    image: require('./img/ikea-lamp.jpg'),
    description:
      'Минималистичная настольная лампа IKEA LAMPAN: высота 29 см, ' +
      'мягкое уютное освещение, легкий белый корпус из полипропилена, ' +
      'длина шнура 1,3 м, максимальная мощность 40 Вт. ' +
      'Впридачу запасная лампа IKEA SOLHETTA.',
  },
  {
    id: 40,
    name: 'ИБП iON A-1500',
    price: 900_000,
    image: require('./img/ion-a1500-1.jpg'),
    description:
      'Линейно-интерактивный ИБП мощностью 1500 ВА/900 Вт с двумя ' +
      'аккумуляторами 12В/9А·ч, четырьмя розетками Schuko, стабилизацией ' +
      'напряжения 170–280В и защитой от перегрузки - идеальное решение ' +
      'для дома и офиса.',
  },
  {
    id: 41,
    name: 'ИБП iON A-800',
    price: 400_000,
    image: require('./img/ion-a800.jpg'),
    description:
      'Линейно-интерактивный ИБП мощностью 800 ВА/480 Вт с аккумулятором ' +
      '12В/9А·ч, двумя розетками Schuko, стабилизацией напряжения 170–280В ' +
      'и защитой от перегрузки, абсолютно бесшумный.',
  },
  {
    id: 42,
    name: 'Macbook Air M1 13” (8GB/256SSD)',
    price: 4_500_000,
    image: require('./img/macbook-m1.jpg'),
    description:
      'Тонкий и лёгкий ноутбук с мощным чипом, 8 ГБ памяти, SSD 256 ГБ, ' +
      'ярким 13,3" Retina-дисплеем (2560×1600), бесшумной работой без ' +
      'вентилятора и автономностью до 18 часов. Почти не пользовался, ' +
      'емкость аккумулятора 100%. Японская клавиатура, поэтому цена снижена.',
  },
  {
    id: 43,
    name: 'Фильтр Аквафор DWM 101S',
    price: 1_000_000,
    image: require('./img/osmos.jpg'),
    description:
      'Компактная система обратного осмоса с минерализацией, удаляющая 99% ' +
      'загрязнений, включая бактерии и вирусы. Работает при низком давлении, ' +
      'защищает технику от накипи. Производительность 187 литров в сутки, ' +
      'запас 5 литров чистейшей воды.',
  },
];

export function getProductById(id: number): Product | undefined {
  return products.find((product) => product.id === id);
}
